{
  "recipes": [
    {
      "name": "Kirsch Kuchen",
      "author": "Darlene",
      "description": "German black forest cake traditionally is an \"adult\" cake made with a cherry liquor called kirsch that comes from the Black Forest region of Germany.  In North America this cake is often found made with a sweet cherry pie filling which is not anything like the real thing.  I was serving this cake to some children and people who were not fond of alcohol in the cake so I used morello cherry juice instead.  The result was a delicious tart moist cake that was delicious.  Feel free to use Kirsch to be authentic if you can find it, just make sure you only serve it to adults as the liquor is not cooked but soaked in the cake.",
      "image": "https://www.internationalcuisine.com/wp-content/uploads/2015/08/German-Black-forest-Cake-684x1024.jpg",
      "instructions": [
        "Pit most of the cherries leaving about 10 for decoration on top of the cake. Take the pitted cherries and soak them in a jar of the 1/2 cup Kirsch overnight.\n",
        "Preheat the oven to 350°F Line the bottom of three 9 inch round cake pans with parchment.",
        "Sift the dry cake ingredients together.",
        "Cream the shortening and sugar. Add the eggs and vanilla and mix well.",
        "Add the dry ingredients alternately with the buttermilk and mix well.",
        "Pour evenly into the cake pans. Bake for 20 minutes or until a tooth pick comes out clean.",
        "Cool and remove the cakes. Prick the tops of the cakes with a toothpick and pour the 1/2 cup of Kirsch (that the cherries soaked in) onto the cake.",
        "In a bowl beat the butter until light and creamy. Add the icing sugar, salt and espresso and mix well. If the icing is too thick add Kirsch or cherry juice.",
        "Cut the cherries into halves.",
        "Place the base layer on top of your cake tray, spread 1/2 of the icing over one top, cover with cherries and top with another layer of cake.",
        "Spread the second half of the filling over that layer of cake, cover with cherries and top with the third layer of cake. Cover this and let sit in the fridge for a day or two to allow the kirsch to soak into the cake and become moist.",
        "The day you're going to serve this cake prepare the icing. Whip the cream until it forms stiff peaks.",
        "Gently fold in the dry milk and icing sugar.",
        "Add the vanilla and pour in the Kirsch until it's a good consistency.\n",
        "If you like more icing double this recipe. Spread the icing over all of the cake.",
        "Place the fresh, intact cherries on top for decoration and cover the top with the chocolate shavings.",
        "Yummy cake"
      ],
      "ingredients": [
        "1 2/3 Cups - Flour",
        "2/3 Cup - Cocoa powder",
        "1 1/2 teaspoons - Baking soda",
        "1 teaspoon - Salt",
        "1/2 cup - Shortening",
        "1 1/2 Cups - Sugar",
        "2 - Eggs",
        "1 teaspoon - Vanilla",
        "1 1/2 Cups - Buttermilk",
        "1/2 Cup - Kirsch",
        "1/2 Cup - Unsalted butter",
        "3 Cups - Icing sugar",
        "1 Pinch - Salt",
        "1/4 Cup - Espresso",
        "1 1/2 lbs - Fresh black berries",
        "2 Cups - Whipping cream",
        "1/2 teaspoon - Vanilla",
        "1/8 Cup - Kirsch",
        "2 tablespoon - Dry milk",
        "2 tablespoon - Icing sugar",
        "1/2 Cup - Dark chocolate"
      ],
      "country": "Germany",
      "id": 14
    },
    {
      "name": "Karelian Pasty",
      "author": "Darlene",
      "description": "Finland Karelian pasties are often times considered the national dish of Finland.  These rye pastries stuffed with a creamy rice or potato mixture and topped with egg butter can be served any time of day.  They are a little tricky to make but not bad.  Egg butter now that was a real hit, yum!",
      "image": "https://cdn.valio.fi/mediafiles/06809767-a1c5-42e2-a4e6-a5e39da1cb6b/1440x1080-recipe-hero/4x3/karjalanpiirakat-1.jpg",
      "instructions": [
        "Rinse the rice and place it in boiling water. Simmer until most of the water is absorbed.Add the milk, lower the heat to a minimum, and partially cover the pot. Simmer until the milk has been absorbed and the rice has turned into a thick porridge. Season with salt and leave to cool.",
        "Add the flour and salt to the water and mix into a solid, compact dough.",
        "Form the dough into a strip and divide into 12 pieces.",
        "Roll the pieces into flat thin ovals.",
        "Spread some filling on each oval. Then fold the sides towards the center, pinching and making neat pleats along the edge.",
        "Bake at 300 ºC for about 10 minutes.",
        "Brush them well with melted butter or a butter and water mixture.",
        "Place the pasties, separated with baking paper, in a bowl and cover with a towel to soften the crusts.",
        "Serve warm with butter or egg butter which is made by mixing equal parts of butter, (cottage cheese) and chopped hard-boiled egg.",
        "Nam nam nam"
      ],
      "ingredients": [
        "1/2 cup - Cold water",
        "1 1/8 cup - Plain flour",
        "3/4 cup - Rye flour",
        "1/2 tablespoon - Salt",
        "1 cup - Water",
        "4 cups - Milk",
        "1 cup - Rice",
        "1 teaspoon - Salt",
        "1/4 cup - Cottage cheese",
        "2 - Hard boiled eggs",
        "1/4 - Soft butter"
      ],
      "country": "Finland",
      "id": 9
    },
    {
      "name": "Roosamanna Ehk Mannavaht",
      "author": "Darlene",
      "description": "Estonia Raspberry semolina mousse is a wonderful dessert treat usually served with milk or cream.  It is also loved as a breakfast dish. The mousse can be made from all sorts of berry juice, just use what you have on hand or love.  Berry picking is a national pass time in Estonia and they have some pretty interesting berries there.  The more you whisk up this dessert, the lighter and fluffier it gets. Enjoy!",
      "image": "https://www.internationalcuisine.com/wp-content/uploads/2015/06/Estonia-semolina-mousse-1024x684.jpg",
      "instructions": [
        "Dilute the juice with enough water to make up 1 quart of liquid (or simply use a quart of cranberry juice drink or something similar). Add sugar to taste and bring everything slowly to the boil.",
        "Pour semolina quickly into the boiling juice, stirring vigorously to avoid any clumps. Simmer in a low heat for about 15 minutes, stirring regularly, until semolina has expanded and you have a thick sweet porridge. Taste - add more sugar, if necessary, or some vanilla sugar, grated lemon or lime zest.",
        "Pour into a large bowl and let cool.\n",
        "Whisk the cool sweet porridge until it's couple of shades lighter and a lot fluffier and lighter in texture.\n",
        "Serve with cold milk."
      ],
      "ingredients": [
        "1 cup - Concentrated juice (your choice!)",
        "4 cups - Water",
        "Or 1 quart - Berry juice (your choice!)",
        "3/4 Cup - Wheat semolina/cream of wheat",
        "up to 1/2 Cup - Sugar"
      ],
      "country": "Estonia",
      "id": 15
    },
    {
      "name": "Cuba Tostones",
      "author": "Darlene",
      "description": "Cuban Tostones are fried plantains. They are popular in many countries and Cuba is no exception. They are delicious sprinkled with just a touch of salt and always best just out of the fryer. You could always dip them in a little left over mojo sauce. They are served as a snack, or as a side with lechon asado or a Cuban sandwich. If you do don’t have a tostonera (tostones press) you can use the bottom of a heavy glass or a food can.",
      "image": "https://www.internationalcuisine.com/wp-content/uploads/2015/03/Cuba-tostones-1024x685.jpg",
      "instructions": [
        "Pour 2-3 inches of oil into a deep-fat fryer or heavy skillet over medium-high heat. As the oil heats, cut the ends off of each plantain, and make a slice along the length of the skin. You should be able to remove the peel in one piece, unlike peeling a banana's skin one section at a time.",
        "Slice each plantain into pieces about two inches long. Add the pieces to the hot oil Fry them for about two minutes until they start to get slightly golden, then flip them over, frying for another two minutes.",
        "Remove the cooked pieces from the pan, and drain them on paper towels. They will be very hot, so let them cool for at least 1-3 minutes. Take one of the pieces, and smash it in a tostonera (tostones press).",
        "If you don't have a tostonera, you can easily use wax paper the bottom of a glass or a food can. Place the plantain piece upright on wax paper, fold the wax paper over the top of it, and then smash it until it is 1/4 inch thick.",
        "Once the cooking oil is hot again, add all of the plantain slices and fry them on both sides until golden brown (about 1-3 minutes). Remove the tostones from the oil, and drain them on paper towels.\n",
        "Sprinkle with a little salt",
        "Tasty"
      ],
      "ingredients": [
        "3-4 cups - Cooking oil",
        "2 - Green plantains",
        "According to your taste - Salt"
      ],
      "country": "Cuba",
      "id": 10
    },
    {
      "name": "Kokoda fish",
      "author": "Darlene",
      "description": "Kokoda Fish is a popular snack or appetizer in many Pacific Island nations. \n\nThis kokoda fish is a little different with the addition of the creamy coconut.  A wonderful addition!   You can use any type of fresh fish that you love but generally a firm white fish works best for this recipe.  You can use either lemon or lime juice to \"cook\" the fish.  I used lemon juice.  You will need to plan ahead as the fish should \"cook\" about 6- 8 hours.",
      "image": "https://arousingappetites.com/wp-content/uploads/2022/08/Arousing-Appetites-8-of-10.jpeg",
      "instructions": [
        "Put the fresh white fish pieces in a non-reactive container and pour over the fresh lemon juice.  Cover and refrigerate, stirring occasionally to make sure all sides of the fish are cooked.",
        "Remove the fish and completely drain the lemon juice the fish was cooked in.",
        "Mix the minced garlic with coconut cream and set aside. ",
        "To the fish, stir in gently the hard-boiled egg, tomato, cucumber and red onion.",
        "Put the kokoda fish into four separate serving bowls and pour over the coconut cream. ",
        "Serve with fried taro root chips or fried plantains for an authentic Papua New Guinean treat!"
      ],
      "ingredients": [
        "2 lbs - White fish filet",
        "1 cup - Lemon juice",
        "3/4 cup - Coconut cream",
        "2 - Eggs",
        "1/2 - Medium red onion",
        "1 - Cucumber",
        "1 - Tomato"
      ],
      "country": "Papua New Guinea",
      "id": 11
    },
    {
      "name": "Montenegrin Prsut",
      "author": "Darlene",
      "description": "Montenegrin prsut is considered to be the national meat of Montenegro.  The famous dry-cured ham is similar to prosciutto which is popular in Italy just across the Adriatic sea.  It is said that it is the ocean air that dries the ham to perfection.  It is called Njeguski Prsut because it must come from this village to be the good stuff that Montenegro is famous for. ",
      "image": "https://images.myguide-cdn.com/montenegro/companies/njeguski-prsut/large/njeguski-prsut-474780.jpg",
      "instructions": [
        "Arrange meat in individual pieces on a platter",
        "arrange the cheese on the platter",
        "Add olives",
        "Repeat another layer for an easy to enjoy appetizer"
      ],
      "ingredients": [
        "1 package - Njeguski prsut or prosciutto",
        "1/2 lb - Soft sheep cheese cut in slices",
        "1/2 lb - Black olives"
      ],
      "country": "Montenegro",
      "id": 12
    },
    {
      "name": "Nepali Pizza",
      "author": "Darlene",
      "description": "Nepali pizza called chatamari is a beloved street food.\n\nIt is easy to see why. It has a perfectly crunchy pizza crust made of rice flour. The topping can be anything from vegetarian style just with onions, and tomatoes or often it is made with some type of minced meat like buffalo or chicken along with the onions.\n\nIt also is topped with some cheese and an egg.\n\nThe chatamari is cooked on the stove top all at once and only takes a quick 7-8 minutes.",
      "image": "https://www.internationalcuisine.com/wp-content/uploads/2017/07/Nepali-pizza-684x1024.jpg",
      "instructions": [
        "In a bowl mix together rice flour and water until you get a thin batter but not too watery. Add water slowly and more if needed.",
        "In another bowl mix together the meat if using, onion, cilantro, cumin-coriander powder, turmeric powder, chili powder, pepper, salt, ginger-garlic paste, serrano and two eggs.",
        "In a skillet that has a lid, heat a tablespoon of oil to medium high heat. A non-stick pan works great for this.",
        "Pour the batter to make a 6 inch circle like a pancake.",
        "Add a portion of the other mixture on top",
        "Break a whole egg on top.",
        "Add about a tablespoon of cheese",
        "Cover and cook for 7-8 minutes",
        "Serve hot you can ads some cilantro and tomatoes for garnish"
      ],
      "ingredients": [
        "2 cups - Rice flour",
        "3/4 cup - Water",
        "4-6 - Eggs",
        "1 cup - Minced meat (chicken or buffalo)",
        "1/4 cup - Chopped fresh coriander",
        "1 teaspoon - Cumin powder",
        "1 teaspoon - Coriander powder",
        "Salt - According to taste",
        "1/2 - Onion",
        "1 teaspoon - Red chili powder",
        "1  - Serrano chili pepper",
        "1 teaspoon - Schezwan pepper",
        "1 tablespoon - Garlic-ginger paste",
        "1 teaspoon - Turmeric powder",
        "4 tablespoon - Shredded cheese",
        "1 - Diced tomato",
        "1 tablespoon - Oil per chatamari"
      ],
      "country": "Nepal",
      "id": 13
    }
  ]
}